import React from 'react';
import { TermsWrapper, PaperWrapper } from './Terms.styled';
import TermsMenu from './TermsMenu';

const Terms = () => {
  return (
    <TermsWrapper>
      <TermsMenu />
      <PaperWrapper>
        <h2>島島阿學資源共享自主學習網站使用者條款</h2>
        <p>
          島島阿學的使命是透過促進自主學習來實現終身學習的能力。我們的服務致力於創造一個值得信賴的學習生態系統，讓學習者可以交流真實的學習經驗，發掘和分享有價值的學習資源，並與志趣相投的人們建立聯繫。透過自我探索、合作及成長，學習者可以充分發揮自己的潛力，並在瞬息萬變的世界中持續發展。
        </p>
        <p>
          此使用者條款為島島阿學資源共享自主學習網站（
          <a href="https://www.daoedu.tw"> https://www.daoedu.tw </a>
          ，以下簡稱「本網站」）使用者於本網站上查找與新增資源、使用找夥伴、揪團和部落格等所有網站功能之規範。我們的使用者條款適用於我們服務的任何註冊使用者或訪客。
        </p>
        <p>本服務僅限於自然人使用，亦僅對自然人生效。</p>
        <ol>
          <li>
            <h3>1. 會員及訪客</h3>
            <ol className="sublist">
              <li>
                <p>
                  當您註冊並加入本網站時，您就成為會員。如果您選擇不註冊我們的服務，您可以作為「訪客」存取某些功能。本網站對所有人開放，對撰寫查證回應之資格沒有設限。
                </p>
              </li>
            </ol>
          </li>
          <li>
            <h3>2. 註冊和帳號使用</h3>
            <p>就島島阿學會員帳戶之註冊及使用事宜，您聲明及保證以下事項：</p>
            <ol className="sublist">
              <li>
                <p>
                  本網站使用者需年滿16歲，當您完成註冊或開始使用服務時，即視為您已經充分審閱、了解及同意本條款，並同意您註冊成為會員及使用服務。
                </p>
              </li>
              <li>
                <p>
                  您同意使用服務之所有內容包括意思表示等，皆以電子文件做為表示方式，且本網站對您的所有通知皆以電子郵件或其他電子方式為之。
                </p>
              </li>
              <li>
                <p>
                  就註冊程序所要求的真實姓名及其他資料，您提供的資訊皆為最新且真實的資料，且如有任何變動的話會即時更新。
                </p>
              </li>
              <li>
                <p>您並非為其他人註冊帳號。</p>
              </li>
              <li>
                <p>您並未也不會註冊兩個以上的個人帳號。</p>
              </li>
              <li>
                <p>如果您的帳號遭停權，您不會註冊另一個帳號。</p>
              </li>
              <li>
                <p>
                  您理解並同意，任何以您的帳號於島島阿學中所為行為，均視為您本人或經您授權所為，您可能因此必須負擔相應的法律責任，因此您不會讓其他人透過您的帳號使用島島阿學服務，亦不會將您的帳號密碼透露與他人知悉。
                </p>
              </li>
              <li>
                <p>
                  您理解並同意，島島阿學為一開放平台，一般使用者均可自由閱覽所有公開頁面，因此您於發表文章、回應或與其他使用者對話時，均應注意您所揭露的資訊可能導致陌生人或您的親友足以辨識您的真實身份，而可能對您的現實生活產生影響。
                </p>
              </li>
              <li>
                <p>
                  您理解並同意，在本網站發起揪團活動內文中充份揭露活動之必要真實資訊，包括但不限於活動目的、內容、要求和所可能需要的費用。
                </p>
              </li>
              <li>
                <p>
                  您理解並同意，在註冊為會員後收到本網站定期電子報，您亦可於收到電子報後隨時取消。
                </p>
              </li>
              <li>
                <p>
                  網站服務僅開放自然人使用，禁止使用自動化方式操作網站。除已知非直接營利的第三方公眾服務網站爬蟲，採低頻率部份內容捉取模式外（如
                  Internet
                  Archive、Google、Facebook），禁止使用自動化方式爬取網站之內容。
                </p>
              </li>
            </ol>
          </li>
          <li>
            <h3>3. 權利和限制</h3>
            <p>
              在您和本網站之間，您擁有您提交或發佈到服務的內容和訊息，並且您僅授予我們以下非獨佔許可：
            </p>
            <p>
              全球範圍內的、可轉讓和可再許可的權利，可使用、複製、修改、分發、發布和處理您透過我們的服務和其他人的服務提供的資訊和內容，而無需向您或其他人提供任何進一步的同意、通知和
              / 或補償。這些權利受到以下方面的限制：
            </p>
            <ol className="sublist">
              <li>
                <p>
                  您可以透過從服務中刪除特定內容的方式終止該內容的許可，或者通常透過關閉您的帳戶來終止該內容的許可，除非
                  (a)
                  您作為服務的一部分與其他人共享該內容，並且他們複製、重新分享或儲存了該內容(b)
                  從備份和其他系統中刪除所需的合理時間。
                </p>
              </li>
              <li>
                <p>
                  如果我們想授予其他人在服務之外發布您的內容的權利，我們將徵得您的同意。
                </p>
              </li>
              <li>
                <p>
                  雖然我們可能會對您的內容進行編輯和格式變更（例如翻譯或轉錄、修改大小、佈局或檔案類型或刪除元資料），但我們不會修改您表達的含義。
                </p>
              </li>
              <li>
                <p>
                  本網站會員登入網站之後，得透過撰寫回應或是評價現有回應、補充其他資訊的方式提供資料貢獻。網站會員撰寫回應時，應採用事實查核手法，回應訊息中可驗證之客觀事實，亦可針對訊息的主觀意見之處，提供他人之不同意見。
                </p>
              </li>
              <li>
                <p>
                  由於您擁有您的內容和訊息，而我們對其僅擁有非專有權利，因此您可以選擇將其提供給其他人，包括根據知識共享授權的條款。
                </p>
              </li>
            </ol>
          </li>
          <li>
            <h3>4. 資料爭議申訴</h3>
            <ol className="sublist">
              <li>
                <p>
                  本網站並不會主動介入任何回應之爭議處理，任何人皆可以直接使用網站撰寫訊息之回應，並歡迎對單一則訊息留下多則回應。
                </p>
              </li>
              <li>
                <p>
                  如果對於既有回應內容有其他爭議處理的狀況，請透過聯絡方式寄發申訴信，與本網站聯繫。
                </p>
              </li>
              <li>
                <p>
                  申訴信內容需要明確包含申訴人之真實姓名與身分、申訴之回應或訊息、申訴之時間地點與申訴之原因。本網站會試圖聯繫該名會員協助處理，或是以提供新回應的方式新增於該訊息內。
                </p>
              </li>
              <li>
                <p>
                  如果會員之回應內容涉及侮辱、毀謗、散布不實資訊、侵害著作權或其他有違反相關法令或侵害他人權利之情事者，本網站得將其回應刪除，並將相關處理資訊紀錄於
                  <a
                    href="https://docs.google.com/spreadsheets/d/1thhT7XFfMN9HNUEjTt68ytzh-jrjGQNgnRHR2K91QGk"
                    target="_blank"
                    rel="noreferrer"
                  >
                    資料申訴爭議處理紀錄
                  </a>
                  。
                </p>
              </li>
            </ol>
          </li>
          <li>
            <h3>5. 免責聲明</h3>
            <ol className="sublist">
              <li>
                <p>
                  本網站不會侵害訊息、回應、佐證資料之各式顯名及人格權利。採 CC0
                  - 1.0
                  收納資訊，主要規劃是擁有後續使用相關資訊的充足地位，並保有是否使用該訊息、回應、佐證資料之最終決定權。
                </p>
              </li>
              <li>
                <p>
                  本網站不為任何第三方取用資料的聊天機器人、網站、內容農場做資料背書，也不承認單方取用本網站所提供資料的合作關係。若其他機器人因為其程式設計的限制，無法正確或有效回應使用者的提問，本網站以及網站協作者不負擔資料庫的修正作業。
                </p>
              </li>
              <li>
                <p>
                  本網站承諾力求網站內容之準確性及完整性，但內容如有錯誤或遺漏，本網站不會承擔任何賠償責任，所有本網站內容，將會隨時更改，而不作另行通知。
                </p>
              </li>
              <li>
                <p>本網站可隨時停止或變更網頁資料而毋須事前通知用戶。</p>
              </li>
              <li>
                <p>
                  本網站不會對使用或連結本網頁而引致任何損害(包括但不限於電腦病毒、系統固障、資料損失)、誹謗、侵犯版權或知識產權所造成的損失，包括但不限於利潤、商譽、使用、資料損失或其他無形損失，本網站不承擔任何直接、間接、附帶、特別、衍生性或懲罰性賠償。
                </p>
              </li>
              <li>
                <p>
                  本網站可能會連接至其他機構所提供的網頁，本公司不會對這些網頁內容作出任何保證或承擔任何責任。使用者如瀏覽這些網頁，將要自己承擔後果。是否使用本網站之服務下載或取得任何資料應由用戶自行考慮且自負風險，因前開任何資料之下載而導致用戶電腦系統之任何損壞或資料流失，本網站不承擔任何責任。
                </p>
              </li>
            </ol>
          </li>
          <li>
            <h3>6. 聯絡方式</h3>
            <p>
              如果您對於本使用者條款、著作權、資料庫處理爭議、服務內容或隱私等有任何疑慮，請寄信至
              <a href="mailto:contact@daoedu.tw"> contact@daoedu.tw </a> 。
            </p>
          </li>
          <li>
            <h3>7. 紛爭解決和管轄法院</h3>
            <p>
              依本使用者條款所產生之爭議，雙方合意以臺灣臺北地方法院為第一審管轄法院。
            </p>
          </li>
        </ol>
      </PaperWrapper>
    </TermsWrapper>
  );
};

export default Terms;
